import { réseau } from "@constl/ipa";

import {
  मिति_चर_पहिचान,
  वर्षा_चर_पहिचान,
  चित्र_चर_पहिचान,
  अकांश_चर_पहिचान,
  देशान्तर_चर_पहिचान,
  उचाई_चर_पहिचान,
  मिति_स्तम्भ_पहिचान,
  चित्र_स्तम्भ_पहिचान,
  वर्षा_स्तम्भ_पहिचान,
  अकांश_स्तम्भ_पहिचान,
  देशान्तर_स्तम्भ_पहिचान,
  उचाई_स्तम्भ_पहिचान,
  S4W_कुञ्जी_शब्द,
  S4W_तालिका_अद्वितीय_कुञ्जी_शब्द,
  temp_चर_पहिचान,
  temp_स्तम्भ_पहिचान,
} from "./विन्यास";

export const डाता_संरचना: réseau.schémaBd = {
  motsClefs: [S4W_कुञ्जी_शब्द],
  licence: "ODbl-1_0", //त्यो तपाईँलाई जस्तो मन पर्छ
  tableaux: [
    {
      idUnique: S4W_तालिका_अद्वितीय_कुञ्जी_शब्द,
      cols: [
        {
          idVariable: मिति_चर_पहिचान,
          idColonne: मिति_स्तम्भ_पहिचान,
        },
        {
          idVariable: वर्षा_चर_पहिचान,
          idColonne: वर्षा_स्तम्भ_पहिचान,
        },
        {
          idVariable: चित्र_चर_पहिचान,
          idColonne: चित्र_स्तम्भ_पहिचान,
        },
        {
          idVariable: अकांश_चर_पहिचान,
          idColonne: अकांश_स्तम्भ_पहिचान,
        },
        {
          idVariable: देशान्तर_चर_पहिचान,
          idColonne: देशान्तर_स्तम्भ_पहिचान,
        },
        {
          idVariable: उचाई_चर_पहिचान,
          idColonne: उचाई_स्तम्भ_पहिचान,
        },
        {
          idVariable: temp_चर_पहिचान,
          idColonne: temp_स्तम्भ_पहिचान
        }
      ],
    },
  ],
};
